## 定目标
### 音频开发的轮廓
1. 了解了音频开发能做什么
播放器，录音机，语音电话，直播，音频处理…但凡有声音的，都可以是你的菜…
2. 音频开发的具体内容有哪些
音频采集/播放，音频算法处理，音频编解码和格式转换，音频传输
3. 难点预测
延时敏感，卡顿敏感，噪声抑制（Denoise），回声消除（AEC），静音检测（VAD），混音算法……
4. 延时标准
根据ITU-TG.114规定，对于高质量语音可接受的时延是300ms。一般来说，如果时延在300～400ms，通话的交互性比较差，但还可以接受。时延大于400ms时，则交互通信非常困难。

### 基础概念
模拟信号转变为数字信号需要经过采样，量化，编码。在此过程中常常涉及以下概念。

#### 采样率（samplerate）
采样率：模拟信号数字化过程，采样率越高，音频信息越丰富，同时相同时间下的文件体积也会越大。根据奈奎斯特理论，采样频率只要不低于音频信号最高频率的两倍，就可以无损失地还原原始的声音。
常用的音频采样频率有：8kHz、11.025kHz、22.05kHz、16kHz、37.8kHz、44.1kHz、48kHz、96kHz、192kHz等。

人耳能听到频率范围大约在20Hz～20kHz之间的声音，为了保证声音不失真，采样频率应在40kHz以上。

#### 量化精度（位宽）
标识一个音频数据的值的大小的数据长度，可以是：4bit、8bit、16bit、32bit等等，位数越多，表示得就越精细
常见的位宽是：8bit 或者 16bit

#### 声道数
由于音频的采集和播放是可以叠加的，因此用声道数一般表示声音录制时的音源数量或回放时相应的扬声器数量。
常见的声道数：单声道（Mono）和双声道（Stereo）

#### 音频帧
一个采样时间下的数据量称为一个音频帧，通常取2.5ms~60ms为单位的数据量。
假设某音频信号是采样率为8kHz、双通道、位宽为16bit，20ms一帧，则一帧音频数据的大小为：
1 byte = 8 bit
int size = 8000 x 2 x 16bit x 0.02s = 5120 bit = 640 byte

#### 音频编码
常见的编码方式有：PCM和ADPCM。编码后未经压缩的无损原始数字音频信号加上文件头信息就可以做为wav文件存储了。该文件包含丰富的音频信息，常用于做各种数据处理，但其体积过大不利于传输。

#### 音频压缩
数据压缩的本质：去除冗余信息

1. 频谱掩蔽效应：仅保留人耳可分辨的声音信号频率：20Hz ~ 20KHz
2. 时域掩蔽效应：当强弱信号同时出现时，仅保留强信号

常见的音频压缩格式：MP3，AAC，OGG，WMA，Opus，FLAC，APE，m4a，AMR，等

#### Android 相关API
音频采集：MediaRecoder，AudioRecord，AudioFlinger 
音频编解码： MediaCodec 
音频播放：AudioTrack，SoundPool，MediaPalyer 

OpenSL ES

### 开源资源
speex、ffmpeg，webrtc audio module（NS、VAD、AECM、AGC）